{"fname": "hiddentest_0", "dialogue": "#Person1#: I have an issue.\n#Person2#: What is your problem?\n#Person1#: There were charges on my debit card that I never made.\n#Person2#: Do you have a statement for your debit card?\n#Person1#: I do.\n#Person2#: Which charges are you talking about?\n#Person1#: It's the last four charges.\n#Person2#: We're going to have to do an investigation.\n#Person1#: Is that going to take long?\n#Person2#: I'm not sure, but in the meantime we will freeze these charges.\n#Person1#: That's wonderful. Thank you."}
{"fname": "hiddentest_1", "dialogue": "#Person1#: I was meaning to talk to you about something.\n#Person2#: What's going on?\n#Person1#: Were you having a party in your apartment last Friday?\n#Person2#: Yes, I had a little party.\n#Person1#: It was very loud.\n#Person2#: I didn't intend on being too loud.\n#Person1#: It's fine if you want to have people over, but I couldn't sleep with the noise.\n#Person2#: I really do apologize for all the noise.\n#Person1#: Next time, do you think that you could keep it down?\n#Person2#: Will do.\n#Person1#: Thank you very much.\n#Person2#: Okay, and once again I'm sorry for keeping you up."}
{"fname": "hiddentest_2", "dialogue": "#Person1#: Hi, I am your new neighbor and was wondering if I could ask you a question or two.\n#Person2#: Hi! I would be happy to answer any questions you might have.\n#Person1#: Everyone here seems very friendly.\n#Person2#: Yes, many of us have lived here a long time and know each other well.\n#Person1#: How long have you lived here?\n#Person2#: I have lived in this building for ten years.\n#Person1#: When I get settled, would you consider giving me a list of places you use, like cleaners and grocery stores?\n#Person2#: I can help you with that. Would you like to go to the local farmer's market with me this morning?\n#Person1#: That would be great!\n#Person2#: Fine. I'll knock on your door around ten o'clock then."}
{"fname": "hiddentest_3", "dialogue": "#Person1#: Yes, I agree. Do you want to take it to a mechanic to have it checked out?\n#Person2#: I already took care of that yesterday.\n#Person1#: That's good. Have you discussed the price with the seller?\n#Person2#: Yes, I think we've agreed upon a fair price.\n#Person1#: Have you set up your financing to pay for this car?\n#Person2#: Yes, my parents are going to loan me the money.\n#Person1#: That's good. Would you like me to go talk to the seller with you and drive your car home?\n#Person2#: That would be a great help!\n#Person1#: Glad to be of help. I can't wait to see your new car!"}
{"fname": "hiddentest_4", "dialogue": "#Person1#: Yes, this city is thousands of years old and has quite a history!\n#Person2#: I really love this temple we are visiting.\n#Person1#: As you enter the temple, please remove your shoes as the others are doing.\n#Person2#: It is so quiet here.\n#Person1#: Yes, they are showing respect to their gods. People come here to pray and meditate.\n#Person2#: I noticed that the women all have some sort of head covering.\n#Person1#: It is a tradition that women cover their heads while in the temple.\n#Person2#: I noticed that all of the people were eating with their hands at dinner last night.\n#Person1#: Yes, that is another custom that people practice here."}
{"fname": "hiddentest_5", "dialogue": "#Person1#: Well, Miss Shen, have you made the plan for our tour in New York?\n#Person2#: Yes, Mr. Haley. Shall I explain the details of the itinerary now?\n#Person1#: No, not now. But would you tell me how you arrange your schedule for May 28?\n#Person2#: Let me look at the plan. Ah, yes, Mr. Haley. We'll visit Ford Company in the morning from 8:30 to 10:00. After 10:00. the deputy general manager of the company, Mr. Blake, will drive us to the hotel, At the some time, he'll talk something about the company with you.\n#Person1#: Is there anything else before lunch time, Miss Shen?\n#Person2#: I'm afraid not.\n#Person1#: In that case, would you please change the plan a little bit? We shall have lunch with Mr. Goode, The General Director of the Sun Chemical Corporation. He will leave for Shanghai in the afternoon.\n#Person2#: All right. What about Mr. Blake?\n#Person1#: We will finish talking before lunch time and join in the talk with Mr. Goode during the lunchtime.\n#Person2#: Yes, Mr. Haley. I'll revise the schedule."}
{"fname": "hiddentest_6", "dialogue": "#Person1#: Mr. Dore?\n#Person2#: Yes.\n#Person1#: How do you do? I'm Su Hua in Public Relation Department. Welcome to Beijing. I'll accompany you to the hotel. \n#Person2#: I must say this hotel is really nice. It's very impressive.\n#Person1#: Yes. In fact, it's considered one of the best hotels in Beijing. You'll get very good service here.\n#Person2#: I think so.\n#Person1#: Please take a look at the itinerary we prepared for you, and let me know if there's any problem.\n#Person2#: Thank you."}
{"fname": "hiddentest_7", "dialogue": "#Person1#: What do you usually do at night?\n#Person2#: The same as in America. Going to a beer house, drinking, chatting and dancing disco. Sometimes I dance ballroom and sing karaoke with friends.\n#Person1#: My father used to work in China for some years. He often complained that he couldn't find a place for fun in the evening. Most people stayed at home and very few could be seen walking on the street at nine or ten o'clock.\n#Person2#: Now it's quite different. Night life is very much enriched. It's very common for young people to enjoy themselves even overnight.\n#Person1#: En. How about another Martini?\n#Person2#: OK."}
{"fname": "hiddentest_8", "dialogue": "#Person1#: Miss Chen, I'll go to America to spend my holiday. Would you please book a seat on a flight from Beijing to Washington this afternoon?\n#Person2#: All right, Mr. Kinite. A telex message from London has just come in. Shall I get it for you?\n#Person1#: Yes, please give it to me now. By the way, any orders today?\n#Person2#: Yes. I've forwarded them to the Sales Department. Here's the telex message from London.\n#Person1#: Thank you.\n#Person2#: Shall I hold your business mail while you are gone or handle the letters myself?\n#Person1#: Handle the letters yourself and keep them on files. But forward private mails to me two weeks before the end of my holiday.\n#Person2#: I see.\n#Person1#: That will be all for now. I'll call on you if I need anything else."}
{"fname": "hiddentest_9", "dialogue": "#Person1#: I am interested in buying auto insurance.\n#Person2#: Sure, I can help you. Did you bring all of your registration papers?\n#Person1#: Yes, I brought everything with me.\n#Person2#: Is your car with you?\n#Person1#: Yes, it is out in the parking lot.\n#Person2#: Wonderful. Let's go out and check to see what shape it is in.\n#Person1#: OK, can you help me figure out what I should insure my car for?\n#Person2#: I will look it up on the Blue Book list and we will factor in its condition.\n#Person1#: What else do I need to consider?\n#Person2#: Yes, you need to figure in liability for damage to the other car as well as injury issues as well."}
{"fname": "hiddentest_10", "dialogue": "#Person1#: So tell me again, why couldn't you get the supplies I ordered?\n#Person2#: Well I ordered them when you asked, but the supplier said they might need to back order them.\n#Person1#: When do you think they will finally arrive?\n#Person2#: I think maybe by Tuesday.\n#Person1#: If they don't arrive by then, what are our options?\n#Person2#: I could try another supplier down the street.\n#Person1#: That would work for me.\n#Person2#: OK, I will stay on it and let you know how it's going.\n#Person1#: Thank you for taking care of the problem.\n#Person2#: Thank you for your business. We appreciate you as a client."}
{"fname": "hiddentest_11", "dialogue": "#Person1#: What do you think about our new CEO, Matt?\n#Person2#: He certainly comes with great credentials. I think he is just the man to get this company off and running.\n#Person1#: The company he left in order to take this job probably regrets losing him.\n#Person2#: I'm sure they do. He was the one who was supposed to assume the leadership of the company when the current president retires.\n#Person1#: Do you know why he left that company?\n#Person2#: Some people said he was impatient to become the CEO. Others said it was because he didn't have enough say in the company.\n#Person1#: I've heard he had a lot of incentive to join our company. There is a rumor that he was given a million dollars as a bonus and an annual salary of a million dollars.\n#Person2#: Yes, and he also will have an 18% share of any increase in the value of the company.\n#Person1#: If the company does as well as many new high-tech companies have done recently, that could mean a lot of money in his pocket.\n#Person2#: That's true. Our company hasn't started issuing stock yet. I feel certain with his leadership the stock will increase in value rapidly when it does go public.\n#Person1#: That's how it's been with other companies like ours. I hope ours will be the same."}
{"fname": "hiddentest_12", "dialogue": "#Person1#: What's wrong with you, madam?\n#Person2#: I'm very hot.\n#Person1#: Here is thermometer. Please check your temperature.\n#Person2#: OK. \n#Person1#: Oh, your temperature is 39 degrees. You'd better have an injection right away.\n#Person2#: I hate injections. Can I take some pills instead of injection?\n#Person1#: An injection is better than pills.\n#Person2#: It's up to you.\n#Person1#: Here is the prescription for you.\n#Person2#: Thank you. Mr. Wang. By the way, I can't sleep well recently, and I feel dizzy.\n#Person1#: What do you do? Do you get a heavy load?\n#Person2#: I'm the secretary of Director Nag of the Education Bureau. There is a lot of work to do every day.\n#Person1#: I know. You may be too busy with your work. Have a good rest, and you'll be all right again.\n#Person2#: Thank you."}
{"fname": "hiddentest_13", "dialogue": "#Person1#: Is this where I catch the Super Shuttle?\n#Person2#: Yes, this is where you catch the Super Shuttle. Where are you headed?\n#Person1#: I am headed home to Pasadena.\n#Person2#: You can tell where each van is headed by the name on the front of the van. I am the driver for Glendale, but your van should be along in a minute.\n#Person1#: Do you know how much it costs to get to Pasadena?\n#Person2#: I believe the cost of that trip is sixty dollars.\n#Person1#: Do you know if the shuttle goes directly to Pasadena, or does it make a lot of stops?\n#Person2#: Before you pay the driver, you need to ask him. He needs to be upfront with you about the number of stops he will be making.\n#Person1#: Do I need to have exact change?\n#Person2#: You don't need exact change, but it is useful to have smaller bills."}
{"fname": "hiddentest_14", "dialogue": "#Person1#: Morning, Bob! Late again!\n#Person2#: Oh, I'm ever so sorry. Managing Director. I can't tell you how sorry I am.\n#Person1#: Mm what's the excuse this time?\n#Person2#: Ah I just don't know what to say. I must have turned off the alarm clock and gone back to sleep. Because I worked overtime all the night.\n#Person1#: Yeah, and last week one of the children wasn't well?\n#Person2#: I'm really sorry. I promise you it won't happen again.\n#Person1#: Never mind. You're always the latest one every time."}
{"fname": "hiddentest_15", "dialogue": "#Person1#: What kind of car insurance do you have?\n#Person2#: I went with the Automobile Club.\n#Person1#: Why did you choose that company?\n#Person2#: I looked at the price of the type of insurance that I wanted.\n#Person1#: What should I think about in choosing services?\n#Person2#: There are websites that will figure out what coverage is right for you.\n#Person1#: What did you end up buying?\n#Person2#: Well, my car is very old, so I didn't worry so much about what it would cost to repair it. I did buy a lot of coverage for fixing someone else's car.\n#Person1#: Have you ever had to use your insurance?\n#Person2#: I never had to use my insurance."}
{"fname": "hiddentest_16", "dialogue": "#Person1#: We are foreign affairs policemen. We need to ask you some questions. Please tell the truth. You'll bear legal responsibility for what you say.\n#Person2#: I see.\n#Person1#: Do you know why you have been taken here?\n#Person2#: Yes. And I'm very sorry for what I did to that waiter.\n#Person1#: Tell us in detail what happened.\n#Person2#: At about 5 o'clock this afternoon, I went to a small pub for dinner.\n#Person1#: What's the name of the pub, and where is it?\n#Person2#: Chang Jiang Jiu Jia in Chang Jiang Street, Huang Gu District.\n#Person1#: Did you drink?\n#Person2#: Yes. I drank 3 bottles of beer.\n#Person1#: Were you drunk?\n#Person2#: Yeah. It was a shame. I got tipsy and knocked a plate off the table. The plate broke into pieces.\n#Person1#: Did you pay for the broken plate?\n#Person2#: No. I paid only for my dinner but not for the plate.\n#Person1#: Did you apologize?\n#Person2#: No, I didn't. And the waiter just wouldn't let me go.\n#Person1#: Why not?\n#Person2#: He asked me to pay for the plate. I got mad and punched him.\n#Person1#: How many times did you punch him?\n#Person2#: 3 times.\n#Person1#: Where did you punch him?\n#Person2#: One in the mouth and the other two in the face.\n#Person1#: Did he fight back?\n#Person2#: No.\n#Person1#: After investigation, we learned that your punches bruised the waiter's face and loosened one of his teeth.\n#Person2#: I drank too much and didn't know what I was doing then.\n#Person1#: You have infringed upon a citizen's rights.\n#Person2#: I'm so sorry. I'd like to apologize to him and pay his medical expense.\n#Person1#: That's good. You have to pay for the broken plate, too. And according to Article 22 of the Regulations of the People's Republic of China on Administrative Penalties for Public Security, you'll be detained for 5 days.\n#Person2#: Oh! Isn't it too harsh?\n#Person1#: You have the right to appeal against this ruling, of course.\n#Person2#: I won't appeal. I'd rather accept it and be done with it."}
{"fname": "hiddentest_17", "dialogue": "#Person1#: I want to look at the souvenirs over at the souvenir stand.\n#Person2#: What do you need to buy?\n#Person1#: I usually buy myself some jewelry or some clothing.\n#Person2#: I always buy a lot of things for my family. How about you?\n#Person1#: Yes, they practically swarm me when I get home!\n#Person2#: What are some of their favorite gifts?\n#Person1#: The teenagers like me to bring them tee shirts that you can't get anywhere else.\n#Person2#: This stuff is pretty expensive, isn't it?\n#Person1#: Souvenirs cost a lot for what they are, but we can shop around for better prices.\n#Person2#: Let's go across the street and see what they have over there."}
{"fname": "hiddentest_18", "dialogue": "#Person1#: I read that your company is downsizing again. What will that mean for your job?\n#Person2#: It means I'm out of a job. They have already given me a 'pink slip'.\n#Person1#: That's bad news. This has happened to you before, hasn't it?\n#Person2#: Yes. This will be the third time in five years and I'm ready to call it quits.\n#Person1#: What do you mean? You're going to quit working?\n#Person2#: No, I'll still be working, but not for a company. I'm going to be my own boss.\n#Person1#: Doesn't that make you a little nervous? You won't have all the benefits that go with working for a company no retire and no health insurance.\n#Person2#: That is the bad part of it, but I am really tired of being dependent on the whims of big business. It seems that it hasn't been all that secure for me.\n#Person1#: What will you do?\n#Person2#: I've had a couple of friends who have gone out on their own. They say it is the best thing that ever happened to them.\n#Person1#: I know it is the secret dream of a lot of people to be their own boss, especially the younger generation.\n#Person2#: One of my friends just takes temporary jobs. Companies are looking for people with his skills, but only on a temporary basis. So he goes for one company to another, depending on where they need him. He's able to set his own working hours and he makes a lot more than he was when he was working full time. He really likes the freedom he enjoys.\n#Person1#: What does he do when he doesn't have any jobs coming in?\n#Person2#: He goes to a temporary employment agency. It seems he always finds work and doubles what he used to make.\n#Person1#: I hope you find just the right thing for your skills. It would be nice to have a job that gave you more freedom.\n#Person2#: That's why I'm making the change. I want to be able to spend the extra time with my family and it will be great to be working at my home instead of going to the office every day.\n#Person1#: Good luck! With your attitude and ability, I'm sure you'll do well."}
{"fname": "hiddentest_19", "dialogue": "#Person1#: How do you plan to pack our order?\n#Person2#: The standard packing. For this kind of products we export, every two dozens are packed in a paper carton, then we pack 10 cartons in one big wooden case.\n#Person1#: The key issue is to make sure that the packing is seaworthy. Of the last goods we received, there were a few items damaged by dampness.\n#Person2#: Yes, we've noticed that, too. But this time each wooden case is lined with plastic sheets from inside, in addition, we've put a 'keep dry' sign on the outside.\n#Person1#: I guess that'll be good enough."}
{"fname": "hiddentest_20", "dialogue": "#Person1#: I guess that we won't be going rollerblading today with all this rain!\n#Person2#: Yes, rollerblading in six inches of water would not be fun. What would you like to do instead?\n#Person1#: I think that maybe we could check out the local mall, grab some lunch, and maybe see a movie.\n#Person2#: Yes, that sounds like a relaxing way to check out the local culture and still stay dry.\n#Person1#: What else could we do in bad weather?\n#Person2#: You know, we could take a double-decker bus tour of famous haunted houses and buildings.\n#Person1#: That would be fun, and the rain would only add to the atmosphere.\n#Person2#: There is an old English pub next door. Maybe when we finish with the haunted house, we can duck in there for some brew.\n#Person1#: What a great idea!\n#Person2#: If we are lucky, maybe they'll have some great food at the pub for supper."}
{"fname": "hiddentest_21", "dialogue": "#Person1#: Mr. Chen, I will make a brief introduction of the office work to you.\n#Person2#: OK, Miss Liu.\n#Person1#: Our office is under the direct leadership of the general manager. The main task is to handle routine business, such as arranging meetings, meeting visitors, seeing visitors off, assigning work, making plans, sorting out the data and collecting information. All these affairs are very important. I'm sure you'll adapt quickly to the work here.\n#Person2#: I hope so.\n#Person1#: Mr. Chen, do you have anything to say about your work?\n#Person2#: No. By the way, Secretary Liu, would you please tell me what the specific work is for me?\n#Person1#: Sorry, I can't tell you now. After you are familiar with all these jobs, we will discuss the problem.\n#Person2#: That's OK.\n#Person1#: Mr. Chen, If you have something to say about your work while working, please come out. The people here are very helpful.\n#Person2#: All right. Thank you."}
{"fname": "hiddentest_22", "dialogue": "#Person1#: Doctor, why is it that I'm always nervous?\n#Person2#: I think your condition has a lot to do with your way of work and life or habits. Now tell me Mr. Thomson. You smoke, don't you?\n#Person1#: Yes. I'm afraid I do, doctor.\n#Person2#: And rather heavily I imagine.\n#Person1#: Yes, I smoke about forty or fifty a day.\n#Person2#: Are you busy with your work?\n#Person1#: Yes, very busy.\n#Person2#: Did you smoke when you are at work?\n#Person1#: Yes, I do.\n#Person2#: You should do your best to stop.\n#Person1#: I've tried to give up smoking several times, but it's no use. What can I do , doctor?\n#Person2#: In my opinion, you have no choice. Either you make a real effort or there's no chance of your feeling better. You must cut it down gradually and I could prescribe some kind of tranquilizer."}
{"fname": "hiddentest_23", "dialogue": "#Person1#: Excuse me. Is this Hua Guang International Trading Company?\n#Person2#: Yes, that's right. Can I help you?\n#Person1#: Well, I'd like to see your sales manager about contracts for office furniture.\n#Person2#: Thank you. Have you made an appointment, Mr. Huang?\n#Person1#: Er no. I'm afraid I haven't.\n#Person2#: Let me see. Ah, I think the sales manager has a full program today. But would you like to take a seat, please? May I phone his office to find out if he can see you?\n#Person1#: Thanks.\n#Person3#: Mr. Banda's office.\n#Person2#: Hello. This is the reception. I have a Mr. Huang here. He wants to know about office furniture contracts. Is Mr. Banda free to see him?\n#Person3#: I'm afraid he isn't. He is talking with an important client now.\n#Person2#: I see. The sales manager is busy at the moment, Sir. Please leave your card and I'll ask him to get in touch with you. Perhaps he can arrange an appointment a few days later.\n#Person1#: All right. Here you are.\n#Person2#: Thank you. Goodbye.\n#Person1#: Bye."}
{"fname": "hiddentest_24", "dialogue": "#Person1#: It seems there are a growing number of new companies in the field of computers who are headed by very young people. Many of them are only in their twenties and already heading up highly successful companies.\n#Person2#: That's true and I think you'll find their style of management to be very different from the traditional type of leadership.\n#Person1#: I think they are more invokes in their companies. They run them as they would run a family. I believe they are more interested in their business and what it will be able to achieve for the good of the world. They don't seem to be as interested in the business as just a way to become rich as their older counterparts are.\n#Person2#: Can you give me some example of their different leadership style?\n#Person1#: Sure, how about this: Young bosses sometimes let their employees bring their children to work, even their pets? Many times they make decisions on the basis of what will be best for their employees instead of what is best for the business.\n#Person2#: I guess young people are more idealistic, so when they have the drive and talent to start a business of their own, they also feel free to manage the business in ways that they believe are ethical and moral.\n#Person1#: Do you think these young businessmen and businesswomen are more ethical and moral than business owners and managers in past generations?\n#Person2#: Yes, I really do. I think businesses in the past haven't been concerned about their employees' personal needs. I think young owners have heard their parents complain about their working situations as they were growing up. Now that they can do things the way they want, they want to change things for the better.\n#Person1#: Right now these young businessmen and businesswomen are making a lot of money, so it is easy for them to demonstrate their lofty ideals. Do you think they will remain true to those ideals during economic hard times?\n#Person2#: I guess we'll just have to wait and see."}
{"fname": "hiddentest_25", "dialogue": "#Person1#: This is it.\n#Person2#: I need to add a few classes.\n#Person1#: What classes would you like to add?\n#Person2#: I need to take some classes that will help me transfer.\n#Person1#: Have you finished any classes so far?\n#Person2#: This is my first semester.\n#Person1#: Did you already take the placement test?\n#Person2#: I took it last month.\n#Person1#: What English and math classes were you placed in?\n#Person2#: I got placed in Math 131 and English 1A.\n#Person1#: Okay. I'll register you for both of those classes."}
{"fname": "hiddentest_26", "dialogue": "#Person1#: Thank you for inviting us to lunch. I am told this is one of the best restaurants in Beijing. I appreciate it very much.\n#Person2#: You're very welcome. Please be seated. Well, how is your visit so far?\n#Person1#: So far so good. Your staff is taking good care of us. I feel very much at home.\n#Person2#: I am glad that we have made much progress this time.\n#Person1#: Sure. And I'm looking forward to our next round of talks.\n#Person2#: Excuse me, bring us the wine, please. Well, please allow me to propose a toast, Ladies and gentlemen, Denver, it is my great pleasure to host this Luncheon in our guests' honor. Over the past four years, our two ministries have established a very constructive relationship. I'm sure your visit will further enhance our cooperation. Now, let me propose a toast to the success of your visit, and the cooperation of our two ministries. Cheers!\n#Person1#: Cheers! Thank you very much, Director. I feel very pleased to join you on this occasion. I fully agree with you, Director, our relationship is very healthy. One of the major purpose of my visit is to further promote our cooperation. I look forward to sharing experience and exchanging views with my Chinese colleagues in the coming days. To your health, Cheers! And once again, thank you for your hospitality.\n#Person2#: Cheers! Cheers! Ah, here are the dishes! This is steamed bass, and this is sweet and sour chop, and ah, try this, lettuce in oyster sauce. By the way, what would you like to drink?\n#Person1#: Beer is OK for me. Well, in return for your hospitality, I'd like to present you a small gift from my boss, Under Secretary Lewis. He asked me to say hello and give this to you in person.\n#Person2#: Thank you and I appreciate it. It's very thoughtful of him. Please remember me to Mr. Lewis when you are back in Washington. I had wonderful conversation with him last time.\n#Person1#: I'll sure do."}
{"fname": "hiddentest_27", "dialogue": "#Person1#: Ms. Zhou, I saw your expresses bicycles and racing bicycles over there. They really look smart.\n#Person2#: You said it. Our production is increasing. They are the new and easily packed in a box for carrying wherever you go, a great favorite with young people abroad.\n#Person1#: How much do they weight?\n#Person2#: Those made of all steel have a net weight of around 17. 5 kilos and those of light aluminum alloy are about 16 kilos only.\n#Person1#: That's impressive. What's your model range?\n#Person2#: In general, we have bikes for gents and ladies size 19', 21', 23', 25' and 27'. The colors vary, depending on the buyer's requirement.\n#Person1#: Good. they could be marketable in our area, but such racing bicycles are new to our consumers. We must be handled very carefully right from the beginning. It's no easy thing to open up a new market.\n#Person2#: We understand that there will naturally be problems in sales promotion at the initial stage. We can offer you excellent terms. So we can safely say that good quality and a reasonable price will make our bikes very competitive."}
{"fname": "hiddentest_28", "dialogue": "#Person1#: Good morning, sir! What can I do for you?\n#Person2#: Good morning. I'm interested in your securities markets. Would you please give me some idea of your securities markets?\n#Person1#: Yes. I'm glad to.\n#Person2#: How many major securities markets are there in China mainland?\n#Person1#: Two. One is Hushi which is in Shanghai and the other is Shenshi in Shenzhen.\n#Person2#: How many listed companies are there all together?\n#Person1#: More than one thousand.\n#Person2#: What should I do if I want to buy stock in big corporations?\n#Person1#: First of all, please register with a broking firm and then make corresponding contract with it.\n#Person2#: I see. Thank you for your introduction.\n#Person1#: You are welcome. I hope you will become our customer. We'll offer you our best service.\n#Person2#: I'd think over your suggestion.\n#Person1#: I hope to see you again.\n#Person2#: So do I."}
{"fname": "hiddentest_29", "dialogue": "#Person1#: Hello, how can I help you?\n#Person2#: Hi, I've got an electronic ticket.\n#Person1#: May I see you ID?\n#Person2#: Sure.\n#Person1#: You are heading for Beijing today?\n#Person2#: Yes.\n#Person1#: Are you checking any bags in?\n#Person2#: One.\n#Person1#: Have you bags been with you since you packed them?\n#Person2#: Yes.\n#Person1#: Did anybody ask you to take anything for them?\n#Person2#: No.\n#Person1#: You are all OK. Here is your boarding pass. Gate A please.\n#Person2#: Could you make sure my frequent flyer number is in the computer?\n#Person1#: Yes. it is on your boarding pass.\n#Person2#: Thanks.\n#Person1#: Have a nice trip!"}
{"fname": "hiddentest_30", "dialogue": "#Person1#: Must I pay for my income tax?\n#Person2#: Yes, according to our tax code, people whose monthly income is above RMB, 200 yuan have to pay for the income tax.\n#Person1#: You mean every person whose monthly income is above RMB, 200 has to pay for it?\n#Person2#: No, there are some exceptions because of tax relief. Citizens should be taxed in proportion to their ability to pay or in proportion to the benefit they receive from the government. Of fundamental importance is that tax must be fair.\n#Person1#: May I ask someone to fill in the tax returns instead of me?\n#Person2#: You must personally file declarations of your income and pay tax within the prescribed time limit. Thank you for your cooperation."}
{"fname": "hiddentest_31", "dialogue": "#Person1#: Excuse me, but are you Mr. John Green from New York?\n#Person2#: Yes, I am John Green from New York.\n#Person1#: Allow me to introduce myself. I'm Wang Tong, interpreter from the Light Industrial Products Corporation, Shenyang.\n#Person2#: How do you do?\n#Person1#: How do you do? May I introduce our manager who has come to meet you?\n#Person2#: Yes, please.\n#Person1#: Mr. Green, this is Mr. Liu. And Mr. Liu, this is Mr. Green.\n#Person2#: Welcome to Shenyang, Mr. Green. I'm happy to meet you. How about your flight?\n#Person1#: The weather was fine throughout the flight.\n#Person2#: Glad to hear that. Is this your first visit to Shenyang?\n#Person1#: Yes, it's my first time here and I've been looking forward to it.\n#Person2#: I hope you'll have a pleasant stay here.\n#Person1#: Thank you. I am sure I'll enjoy it. Mr. Liu, I am a stranger. I know nothing of your customs and cannot speak the language. I hope you will give me some suggestions.\n#Person2#: You needn't worry about anything, Mr. Green. The weather here is agreeable. You'll get along perfectly, I assure you. How long do you intend to stay?\n#Person1#: About three weeks.\n#Person2#: Good. We'll have enough time for our talks. And at the intervals between business talks, we'll arrange some sightseeing for you, if you care for it.\n#Person1#: Would I care for it? I must say nothing would please me more.\n#Person2#: Mr. Green, I'm sorry I'll have to leave you now as I have an appointment at 9:00. I'm sure Miss Wang will help you see to your checked luggage and take you to be hotel.\n#Person1#: Thank you."}
{"fname": "hiddentest_32", "dialogue": "#Person1#: What can I help you with today?\n#Person2#: I need to talk to you about transferring.\n#Person1#: Where did you want to transfer to?\n#Person2#: I have no idea.\n#Person1#: You have plenty of time to think about it.\n#Person2#: What do I need to do in order to transfer?\n#Person1#: You're going to need to finish your General Education.\n#Person2#: How many classes is that?\n#Person1#: The GE is 60 credits worth of classes.\n#Person2#: Is that a lot?\n#Person1#: You can finish in about two years.\n#Person2#: Oh. That shouldn't be a problem at all."}
{"fname": "hiddentest_33", "dialogue": "#Person1#: You haven't said a word about my new suit, Marie. Don't you like it?\n#Person2#: I'm sorry I didn't say anything about it sooner. It certainly is unique. I don't think I've seen anything like it before.\n#Person1#: I know. That's why I bought it. I hate wearing the same styles everybody else is wearing. Do you think it makes me look too big?\n#Person2#: Well, horizontal stripes always make people look larger than they really are. But I really like the fabric. Is it silk?\n#Person1#: Silk and linen. I love the way it feels.\n#Person2#: And the colour is vey unusual.\n#Person1#: Thanks. That's another reason why I like it. You don't see much peach and brown these days."}
{"fname": "hiddentest_34", "dialogue": "#Person1#: What's your reason for wanting to go to the United States?\n#Person2#: I'm going to join my husband at the University of Mississippi.\n#Person1#: Is your husband currently a student there?\n#Person2#: No, he's a visiting research scholar. His research field is Southern literature. That's why he chose to go to the University of Mississippi at Oxford. William Faulkner's hometown.\n#Person1#: How long have you been married to your husband?\n#Person2#: We've been married for seventeen years.\n#Person1#: How long has your husband been in the United States?\n#Person2#: Eight months.\n#Person1#: How long do you plan to stay there?\n#Person2#: Maybe six months, maybe longer, maybe I'll fly back together with my husband at the end of the year."}
{"fname": "hiddentest_35", "dialogue": "#Person1#: What kind of visa do you have?\n#Person2#: It's a student visa.\n#Person1#: When did you enter China?\n#Person2#: I came into the country on May 30, 2001.\n#Person1#: What was your port of entry?\n#Person2#: Guangzhou, White Cloud International Airport.\n#Person1#: We understand that you're not attending school.\n#Person2#: No. I've been attending. But I've been sick recently.\n#Person1#: You've attended only ten days since last June.\n#Person2#: Ten days? No. It's been more than that.\n#Person1#: We've going to have to take away your visa and have you deported."}
{"fname": "hiddentest_36", "dialogue": "#Person1#: I'm glad to meet you again, sir.\n#Person2#: Me, too.\n#Person1#: Anything I can do for you?\n#Person2#: Yes, please. I've registered with you and deposited some money. Now I'd like to know something about commission and stamp tax.\n#Person1#: We ask 3 thousandths for commission. It is a little cheaper that most other firms. As to stamp tax, it is the same everywhere: two and half thousands.\n#Person2#: 3 thousandths for what?\n#Person1#: Oh, equity turnover.\n#Person2#: Sounds not bad. By the way, what is the least unit of one purchase?\n#Person1#: 100 shares, also known as a round lot.\n#Person2#: I see. Thank you. Well, we can get all the information we need through a computer, can't we?\n#Person1#: Exactly. For further understanding, would you please come with me and I'll show you.\n#Person2#: Why not?"}
{"fname": "hiddentest_37", "dialogue": "#Person1#: What's the aim of tariff?\n#Person2#: The first aim is to increase revenue income, and the tariff serves this function which is called Revenue Duties. The second aim is to protect domestic production and markets, and this kind of tariff is called Protective Duties.\n#Person1#: May I know the classification of tariff?\n#Person2#: Yes, but according to different criterion, there are many kinds of tariff.\n#Person1#: Can you give me an example?\n#Person2#: OK. According to the difference in treatment and implementation, there are Import Surtaxes, Variable Levy, Preferential Duties, and General System of Preferences.\n#Person1#: I know that there are NonTariff Barriers. What's the meaning of NTBs?\n#Person2#: Oh, NTBs refers to make use of some non-tariff steps to restrict import."}
{"fname": "hiddentest_38", "dialogue": "#Person1#: Have you ever purchased health insurance before?\n#Person2#: I have health insurance now, but I want to look into other choices.\n#Person1#: Do you know if you are interested in an HMO or a PPO?\n#Person2#: Could you explain the difference to me?\n#Person1#: To clarify it for you, with a PPO you pay more but you get to choose your own doctor.\n#Person2#: When I pay for a service, is the payment the same for a PPO or HMO?\n#Person1#: The payment is different. It can be higher for a HMO.\n#Person2#: How much will an HMO cost me per month?\n#Person1#: Go to our website and fill in the questionnaire. Once we have all of your information, we can give you a quote."}
{"fname": "hiddentest_39", "dialogue": "#Person1#: Good afternoon, madam. Can I help you?\n#Person2#: Could you tell me my balance in this Letter of Credit?\n#Person1#: Oh, madam! The L/C is exhausted.\n#Person2#: Well, could you find out whether there is a remittance for me from New York?\n#Person1#: Wait for a moment. I'll check for you. Yes, madam. There is a remittance for you. There are five hundred dollars.\n#Person2#: I want to convert the remittance into RMB. What exchange rate you are giving?\n#Person1#: The exchange rate between U.S. dollar and RMB is 826 yuan for 100 U.S. dollars. How much of the remittance do you want to convert into RMB?\n#Person2#: The full amount of the remittance.\n#Person1#: Do you have any means of identification, please?\n#Person2#: Yes, here is my passport.\n#Person1#: Please sign the receipt in duplicate.\n#Person2#: Is it all right?\n#Person1#: OK. five hundred dollars make 4,130 yuan. Here are the cash and your passport. Have a check, please!\n#Person2#: 4,130 yuan, that's right. Thank you very much.\n#Person1#: You're welcome."}
{"fname": "hiddentest_40", "dialogue": "#Person1#: Brian, may I have a word with you?\n#Person2#: Of course, Linda. What can I do for you?\n#Person1#: This is difficult for me, because you and I have worked together for ages but I've accepted a position at another company.\n#Person2#: Linda! I wasn't even aware that you'd been scouting around. May I ask you why?\n#Person1#: I want to make it clear that my decision is no reflection on Angel. I've learned a lot here, and I appreciate the opportunity I've been given here.\n#Person2#: Is it what I've done, or haven't done? This news really surprises me.\n#Person1#: Brian, you've really been great to me, and I'm thankful that you've taken me under your wing and taught me so much.\n#Person2#: I must admit that I'm still confused. If there's nothing wrong here. Why are you leaving?\n#Person1#: Well, I feel I've grown professionally as much as I can, and I need some new changes.\n#Person2#: I see. Were there any other reasons?\n#Person1#: To be perfectly honest, the chances for advancement are good, and the money was just too good to turn down.\n#Person2#: Linda, you know how much I value your work. Why didn't you come to me earlier so we could talk about it? We might have had a chance to top the other offer!\n#Person1#: I'm sorry, Brian.\n#Person2#: I suppose it's too late to make any sort of counter offer.\n#Person1#: I'm afraid so, The offer came out of the blue, and I had to make a choice immediately. It was the chance of a lifetime, and I really felt I couldn't turn it down.\n#Person2#: Well, I'm sad to see you go, Linda. But I do wish you all the best in your new career.\n#Person1#: Thanks, Brian. Your understanding and support mean a lot to me. I won't be leaving right away. This is my two week's notice."}
{"fname": "hiddentest_41", "dialogue": "#Person1#: Hello, Professor Guo! I ran into Mr. Li the other day and he told me you were recently appointed head of the English Department at the Beijing Foreign Studies University. Is that true?\n#Person2#: Yes, it is, Mr. Wang.\n#Person1#: Oh I'm delighted to hear it. Please accept my sincere congratulations! I knew it would be only a matter of time before your extraordinary abilities were recognized.\n#Person2#: That's very nice to you to say so, but I think my abilities still leave much to be desired.\n#Person1#: Well, I'm glad to know you have achieved the goal you've been working towards all these years. I wish you the greatest possible success. And again my heartiest congratulations!\n#Person2#: Thank you very much, Mr. Wang."}
{"fname": "hiddentest_42", "dialogue": "#Person1#: Could our company receive and spend foreign exchange freely?\n#Person2#: First, you have to open an account in a bank that deals in foreign exchange business in China. The bank would supervise the receipts and expenditures.\n#Person1#: Can we change foreign exchanges for selling our products in China?\n#Person2#: If we're in urgent need of them that can also substitute import products, you can change foreign exchange with approval after Chinese foreign exchange authorities.\n#Person1#: How about foreign workers' foreign exchange income?\n#Person2#: After paying the income tax according to Chinese laws, foreign workers' income can be remitted freely."}
{"fname": "hiddentest_43", "dialogue": "#Person1#: Good morning, sir. What can I do for you?\n#Person2#: I want to talk to the manager.\n#Person1#: I'm the manager. Please have a seat.\n#Person2#: I have a complaint to make.\n#Person1#: Go ahead, please.\n#Person2#: I bought a radio set here, but I found it didn't work when I went home. I took this radio set back here. The salesgirl who sold it refused to change for another one. So I'm here to talk to you.\n#Person1#: Could I take a look at the radio set?\n#Person2#: Sure, here you are. You see, it just makes some strange noises and radio signals can't be heard.\n#Person1#: Have you ever opened the back cover?\n#Person2#: No, never. You can see the seal intact.\n#Person1#: Do you take the receipt with you?\n#Person2#: Yes, here is the receipt.\n#Person1#: Okay, you did buy it from here. I'm sorry for the trouble. Please follow me. We'll change for another one for you.\n#Person2#: Thank you.\n#Person1#: Miss Zhang, this gentleman bought a radio set yesterday, but it doesn't work. Please change this one for him.\n#Person3#: OK. I'll get it right away.\n#Person1#: Sir, what about this one?\n#Person2#: Let me see. Mm, this is a good radio set. Thank you.\n#Person1#: You're welcome."}
{"fname": "hiddentest_44", "dialogue": "#Person1#: Excuse me, can I change money in this hotel? I want to change some RMB to cover my expense here.\n#Person2#: Yes, over there by the reception counter.\n#Person1#: I'd like to change 100 dollars. What is the exchange rate today?\n#Person2#: Sorry, sir. I'm not sure. You will have to ask at the exchange desk. He will tell you the exact rate.\n#Person1#: But where is the exchange desk?\n#Person2#: In the front lobby, sir. And don't forget your passport, sir! You have to show it to the clerk before he changes money to you.\n#Person1#: Oh, I see. Thank you so much for helping me.\n#Person2#: Not at all."}
{"fname": "hiddentest_45", "dialogue": "#Person1#: Excuse me. Could you help me to break this 500 U. S. dollar note?\n#Person2#: Certainly. What kind of currency do you want?\n#Person1#: Japanese yen. What is the exchange rate for U. S. dollar against Japanese yen today?\n#Person2#: Our buying rate is 120 yen to one U. S. dollar.\n#Person1#: How much would I get for this note?\n#Person2#: 500 dollars make 60, 000 yen. I'd like to know how I shall give it to you? Will six 10, 000 yen notes be all right?\n#Person1#: Sorry. Would you mind giving me some more small notes? I hope you will give me five 10, 000 yen, five 1, 000 yen and the rest in small notes.\n#Person2#: Certainly. Would you kindly sign the exchange form giving your name and address?\n#Person1#: Sure. Is it all right?\n#Person2#: OK. There are your cash and the exchange memo. Have a check, please.\n#Person1#: That's right. Thanks a lot.\n#Person2#: You're welcome."}
{"fname": "hiddentest_46", "dialogue": "#Person1#: Fire department.\n#Person2#: I'd like to speak to someone about a fire I had last night on my farm.\n#Person1#: Do you have a policy with F. P. A?\n#Person2#: I do. That's why I'm phoning you now.\n#Person1#: All right, sir. could you give me the number of the policy?\n#Person2#: It's PA B.\n#Person1#: Can you give me a moment while I look up your records on the computer. Are you Mr. Li, Li Daqing at Grand Farm?\n#Person2#: That's right.\n#Person1#: You say you've had a fire. Can you tell me what happened?\n#Person2#: Well, we woke up in the night to find the barn blazing."}
{"fname": "hiddentest_47", "dialogue": "#Person1#: The office is having a retirement party for Walter Wright next week.\n#Person2#: Has he worked here a long time?\n#Person1#: Well. I have been here for 15 years and he was here when I came. Walter will have plenty of money when he retires. Money will not be a problem. He has his pension from here at work, he and his wife will both have their social security retirement and he had a good savings program as well.\n#Person2#: I don't think Walter's wife ever worked outside the home. Does she still qualify for social security?\n#Person1#: Wives have the option of taking their own retirement from social security or, as in the case of Walter's wife, they just get a certain percentage of their husband's retirement.\n#Person2#: I know of people who have retirement from several different sources. Paul Haley was in the Navy for 20 years and so qualified for a retirement income there.\n#Person1#: Does he have income from any other sources?\n#Person2#: He taught school long enough to qualify for a retirement there and then he was elected to public office and served for several years and is now getting a retirement income there as well.\n#Person1#: I'm afraid my retirement income is not going to be very good. I haven't planned very well for the future. But I guess it's never late. I had better do something about it."}
{"fname": "hiddentest_48", "dialogue": "#Person1#: Tomorrow is my parents' wedding anniversary day, and we'd like to have you join us in a dinner party.\n#Person2#: Congratulations!\n#Person1#: Thank you.\n#Person2#: Where will you celebrate it?\n#Person1#: We're going to have a dinner party at home this time. My brother has just graduated from a vocational school. You know, he is one of the top students in his cooking class.\n#Person2#: That's to say he is a certified cook now.\n#Person1#: Yes.\n#Person2#: Congratulations again.\n#Person1#: Thank you. He is going to prepare some Chinese food for us.\n#Person2#: Wonderful! I'll definitely come."}
{"fname": "hiddentest_49", "dialogue": "#Person1#: Hello, Miss Shen, how are you?\n#Person2#: Hello, I'm fine, thank you. And you?\n#Person1#: I'm fine, thanks. Our claiming of Reimburse was refused yesterday by Scotia Bank.\n#Person2#: Why was it refused?\n#Person1#: They said they were supposed to reimburse the payment whose tenor was before Feb. 22, 2002.\n#Person2#: We have changed the tenor to May 1, 2002.\n#Person1#: But they said they didn't receive any information.\n#Person2#: Yes, that was our mistake. I'll send our amendment this afternoon, and you can get your reimbursement tomorrow.\n#Person1#: I hope you send this kind of message in time. It will make our cooperation better.\n#Person2#: Yes, we will try our best to avoid this kind of mistake. Thank you very much for your reminding and patience.\n#Person1#: You are welcome. Bye bye!\n#Person2#: Bye."}
{"fname": "hiddentest_50", "dialogue": "#Person1#: I'm from auto accident department. Are you Mr. Burns?\n#Person2#: Hi, Yes, I am William Burns.\n#Person1#: I'm so sorry for your loss and suffering.\n#Person2#: Thank you. It's very kind of you to say so.\n#Person1#: You know it's brutal for me to ask you questions. But I have to. How did it happen?\n#Person2#: According to the witness, my son was at the stoplight over there when a drunk driver ran right into him, and both cars went airborne hitting a nearby building.\n#Person1#: Oh, I'm really sorry. And I'd like to have some idea about the present condition of the car.\n#Person2#: Sure! Follow me."}
{"fname": "hiddentest_51", "dialogue": "#Person1#: I'm sorry for your loss. But there's nothing we can do for you.\n#Person2#: Are you kidding? I pay my premium regularly. There is a fire, and I lost everything.\n#Person1#: Listen, Mr. Ma. In the proposal form you were asked whether any inflammable materials were stored on the premises. You said 'no'. But we found that a ground floor storeroom was used to store dreams of petrol.\n#Person2#: And you think I burned my own business premises with these drums of petrol?\n#Person1#: I don't mean that. But the most good faith is one of the principles of insurance. What could we insure if everybody lied to us?\n#Person2#: You are exaggerating the very fact. It's unfair. I cannot accept that.\n#Person1#: Who is exaggerating?\n#Person2#: I will sue you."}
{"fname": "hiddentest_52", "dialogue": "#Person1#: Good morning, is this the Renter's Hotline?\n#Person2#: Yes, what can I help you with?\n#Person1#: I have a question about discrimination in housing.\n#Person2#: What type of discrimination?\n#Person1#: I think that he doesn't want to rent to me because of my race.\n#Person2#: What made you think that your race was a problem?\n#Person1#: He seemed OK talking to me on the phone, but seemed to change his mind when he saw me in person.\n#Person2#: What else made you feel he was discriminating against you?\n#Person1#: Well, he had a 25 unit apartment building and everyone I saw there was his same race.\n#Person2#: Racial discrimination is very hard to prove, but if you would like to come down, we can go over a checklist that can help you build a case."}
{"fname": "hiddentest_53", "dialogue": "#Person1#: Did you and your family do anything to protect your property from further losses and damage?\n#Person2#: We managed to get the cattle out of the cowsheds. Then the fire spread.\n#Person1#: This policy doesn't cover the livestock.\n#Person2#: I realize that.\n#Person1#: Do you have the policy in front of you?\n#Person2#: Yes.\n#Person1#: Can you refer to Schedule One?\n#Person2#: Yes, yes. I'm looking at it.\n#Person1#: Can you confirm that the items we're referring to are the outbuildings numbered one to four?\n#Person2#: That's right. Only we managed to save the cowshed number three on the schedule.\n#Person1#: No damage?\n#Person2#: Well, it's badly scorched.\n#Person1#: Do you know how the fire started, Mr. Li?\n#Person2#: Not really, It's an open barn and with this warm dry weather, it can get very hot. It could have been internal combustion. But we've had a fire raiser in the area. Old Zhang lost a couple of haystacks last month and that was deliberate.\n#Person1#: If there's any question of arson, the police will have to be notified.\n#Person2#: I realize that, but there's no way I can tell.\n#Person1#: All right. I'll send you a claim form right away. Incidentally, I'm Zhu Qi. If you have any difficulties in completing the claim form, please free to let me know.\n#Person2#: Thanks for your help. Goodbye.\n#Person1#: Goodbye, Mr. Li."}
{"fname": "hiddentest_54", "dialogue": "#Person1#: I'm the agent of the Gulf Company. I'm afraid there may be some disputes over the results of inspection.\n#Person2#: You can apply for reinspecion within the prescribed time limit.\n#Person1#: Would you tell me whether we, the buyers, have the right to reinspect the goods when the goods arrive? Are we entitled to lodge claims?\n#Person2#: But for this item, it is international practice that the reinspection should be made within 7 days upon the arrival and if any discrepancies are found, you may lodge claims within 30 days.\n#Person1#: What if the results from the inspection and the reinspection are different?\n#Person2#: You can apply to the State Administration for Entry Exit Inspection and Quarantine of the People's of China for reinspection, but this should be done within 15 days upon your receiving the former reinspecion result, and this bureau will make the final conclusion within 60 days."}
{"fname": "hiddentest_55", "dialogue": "#Person1#: I heard you've been promoted recently. Congratulations!\n#Person2#: Thanks. I guess I was just lucky.\n#Person1#: I think you deserve it. You've been working so hard: working for long hours, no vacation for three years, and frequent trips to America.\n#Person2#: Yeah, it was pretty tough in the last few years. But all hard work pays off.\n#Person1#: I always wonder what kinds of jobs are considered good.\n#Person2#: I think monetary reward is a major concern. The more a job brings you, the better it is.\n#Person1#: But money isn't everything. I think job satisfaction is also very important. You have to feel happy while doing your job. Otherwise, it's meaningless even though you're well paid.\n#Person2#: I agree. Really, I think a good job should have a balance between these two factors.\n#Person1#: That's true. What time it is now. Oh, it's too late. Sorry, I can't wait to go home.\n#Person2#: See you next time.\n#Person1#: See you."}
{"fname": "hiddentest_56", "dialogue": "#Person1#: Do you think I could discuss the environment problem with you?\n#Person2#: Well, now, you have examined the report about the lake water quality?\n#Person1#: The citizens have complaints and wonder why government hasn't come up with a single plan to solve the problem?\n#Person2#: We re trying to find ways. The best we can do now is to talk less and do more.\n#Person1#: Yes. You never can solve problems by talking instead of doing.\n#Person2#: Right! Let's work hard and face the problems together."}
{"fname": "hiddentest_57", "dialogue": "#Person1#: Well, Clerk. My policy covers my house against fire, right?\n#Person2#: Correct.\n#Person1#: And there is fire and my house burns to the ground.\n#Person2#: Absolutely.\n#Person1#: I consult an architect, and it is estimated that it will cost $350, 000 to reconstruct the house as it was before the fire. But will you only contribute $200, 000 to the cost of rebuilding?\n#Person2#: You know, an axiom of insurance is indemnity. That's to say the insured cannot expect to make a profit out of the insurance contract.\n#Person1#: But you know, it cannot cover my reconstruction cost.\n#Person2#: I see. But the premium is $3 per $1, 000 of cover and you pay $250 premium per annum. Why?\n#Person1#: I reckoned my house was worth $200, 000.\n#Person2#: That's it. Your policy covers a house worth $200, 000. And according to the contract, my company can only pay you that sum.\n#Person1#: Well, I understand now."}
{"fname": "hiddentest_58", "dialogue": "#Person1#: When should we apply for entry?\n#Person2#: Which kind of products do you import?\n#Person1#: Industrial chemicals.\n#Person2#: Then about not less than twenty days before the claim is valid which is prescribed in your contract. If the claim's period of validity is not enough to finish inspection, the applicant must go through the formalities to lengthen the period of validity of claim.\n#Person1#: Where should I apply?\n#Person2#: For import industrial chemicals, and chemical products, it's difficult to take representative samples according to the former batch number, so you should apply to the port.\n#Person1#: What lists should I provide?\n#Person2#: Foreign trade contracts, foreign receipts and bill of lading.\n#Person1#: Thank you!"}
{"fname": "hiddentest_59", "dialogue": "#Person1#: Good morning, Ma'am.\n#Person2#: Good morning.\n#Person1#: Are you Director Xiao, the office manager?\n#Person2#: Yes, I am. Who are you?\n#Person1#: I'm the new secretary.\n#Person2#: Oh, yes. I was out of town last week and didn't get to meet you. What's your name?\n#Person1#: My name's Su Xinxin.\n#Person2#: It's nice to have you with us. We have a lot of work to do here. You'll be very busy. That's your desk over there.\n#Person1#: Thank you. Director Xiao.\n#Person2#: And that's your computer. There's a fax machine at either end of the corridor.\n#Person1#: It's really convenient. I love this place.\n#Person2#: And please call me Xiao Yanli.\n#Person1#: Thank you, Ms. Xiao and I'd like to be called Sue."}
{"fname": "hiddentest_60", "dialogue": "#Person1#: Hi, professor, how's everything going today?\n#Person2#: Fine, I'm ready for your second question. What's that?\n#Person1#: My second question is still about money. In ordinary form, is there a blank space between the currency and the amount?\n#Person2#: No, there is not. For example, we should write HK $4,785 instead of HK $4,786.\n#Person1#: Oh, I see. Is there anything I should be aware of when writing money amount?\n#Person2#: On some formal bill, the capital form should begin with 'say' and end with 'only', to highlight the amount. For instance, 'Say five thousand and eighty five pounds sixty pence only'.\n#Person1#: That's interesting. Can you show me another example?\n#Person2#: Sure. 'Say six thousand and seventy seven US dollars only'.\n#Person1#: I get a better understanding of foreign currencies through your explanation. Thank you very much. Goodbye.\n#Person2#: You are welcome. Come here if you have any questions. Bye bye!"}
{"fname": "hiddentest_61", "dialogue": "#Person1#: Is that the manager?\n#Person2#: Yes, I am. Can I be of any assistance?\n#Person1#: This is Ms. Dane, Room 607. I've just received my laundry. There is still a stain in my trousers and my blouse has faded.\n#Person2#: I'm awfully sorry to hear that. I'll put you through to the housekeeper. She'll attend to it right away.\n#Person3#: Hello. Housekeeper.\n#Person2#: OH, hello. This is Ms. Dane from Room 607. It's about my laundry I've just received. There is still a stain in my trousers and my blouse has faded.\n#Person3#: I'm very sorry. May I take your trousers back to the laundry? We'll wash it again. And your blouse, we'll make up the loss somehow. Is there anything else I can do for you?\n#Person2#: No. Thank you.\n#Person3#: You are welcome."}
{"fname": "hiddentest_62", "dialogue": "#Person1#: Good morning, sir. What can I do for you?\n#Person2#: Can you exchange U. S. dollars for Hong Kong dollars?\n#Person1#: Yes, how much do you want to change?\n#Person2#: Two hundred U. S. dollars. What's the exchange rate today?\n#Person1#: One U. S. dollar to 6. 7 HK dollars. Please show me your passport, sir.\n#Person2#: OK. Here you are, and here are 2 hundred notes. Please give me thirteen 100 HK dollar notes.\n#Person1#: OK. Anything else?\n#Person2#: I have a traveler's letter of credit opened by FEDERAL RESERVE BANK. I'd like to know the rate for this traveler's L/C.\n#Person1#: Oh, let me see, the buying rate is one U. S. dollar to 6. 7 HK dollars.\n#Person2#: Could you tell me why the buying rate is quite different from what you just quoted? Is there any change in the rate?\n#Person1#: I will be very glad to explain it to you. You see foreign currency is not negotiable in china. So we have to send the notes abroad by post and shall not be covered with the fund until a later date. It will also cost us freight and insurance charges in doing so. That is why the buying rate of the notes is lower.\n#Person2#: Oh, I see.\n#Person1#: Will you draw money against your traveler's L/C right now sir?\n#Person2#: No, thank you. Thank you very much for your good explanation and all you've done for me.\n#Person1#: It's a pleasure."}
{"fname": "hiddentest_63", "dialogue": "#Person1#: Good afternoon and welcome to Bank of China, it is my pleasure to make your acquaintance. My name is He Wei.\n#Person2#: Mr. He, the pleasure are all ours, we are honored to have the chance to visit your bank.\n#Person1#: Bank of China is a state-owned enterprise and is a specialized foreign exchange bank of the People's Republic of China. And our bank has the longest history among the present banks in China. And now we pay much attention to our traditional business. We are the first to act as agency to handle international credit cards and traveler's cheque.\n#Person2#: How many kinds of currencies can we change in the bank?\n#Person1#: You can change U. S. Dollar, Australian Dollar, Canadian Dollar, Singapore Dollar, Hong Kong Dollar, French France, Swiss Franc, Florin, Japanese yen and Pound Sterling.\n#Person2#: Thank you, Mr. He. Thank you very much for your explanation.\n#Person1#: Not at all. I am very glad to have all for you here. I hope you will come again.\n#Person2#: I hope so. Goodbye!"}
{"fname": "hiddentest_64", "dialogue": "#Person1#: Susan, it's our first time attending such a trade show. I don't quite know how to prepare for it. Would you mind telling me something about it?\n#Person2#: All right. I'll be happy to tell you anything I know.\n#Person1#: How should we get people to come to our booth?\n#Person2#: Yes, it means a lot. First, you should make sure that your display is culturally acceptable and attractive to customers, and then you should try to make the booth noticeable. You could have presentation of your products every hour or two, and at the same time, you could prepare some freebies.\n#Person1#: Cheers! What you say gives me a lot of ideas. What kind of presentation is more attractive, an individual or a group?\n#Person2#: A group presentation creates more interest.\n#Person1#: I see. I'll get busy now with the preparations for the show."}
{"fname": "hiddentest_65", "dialogue": "#Person1#: I am from a foreign funded enterprise, and we will export a lot of goods to European Union. Can you tell me if we can apply for the General System of Preferences?\n#Person2#: Of course, you can. But first you must go to the inspection and quarantine institution to register yourself.\n#Person1#: What kind of material should we provide?\n#Person2#: The copy of the instrument of ratification for running export business and the copy of your business license are enough. And you must apply to the inspection and quarantine institution for visa five days before you ship your goods. And at the same time, you should submit application and relative documents.\n#Person1#: What? We have to dispatch our goods tomorrow because the buyer needs the goods urgently. What should we do?\n#Person2#: The form of the certificate of origin should be issued before you dispatch your goods, but under this special condition, you can apply for the certificate issued retrospectively.\n#Person1#: What kind of procedure does it need?\n#Person2#: Besides the documents mentioned above, you have to submit the bill of lading of your goods.\n#Person1#: Is that all?\n#Person2#: Yes, with these materials, I think it should be okay."}
{"fname": "hiddentest_66", "dialogue": "#Person1#: Claim service department.\n#Person2#: Hello! I'm calling to appeal a property insurance claim denial.\n#Person1#: May I have your name, please?\n#Person2#: Mr. Li, Mr. Li Wenming.\n#Person1#: Yes. I've found your name here in the records. You lost your house in a landslide.\n#Person2#: No. It was not a landslide.\n#Person1#: Then what is it?\n#Person2#: It was an earthquake.\n#Person1#: Perhaps there is some misunderstanding here. I'll contact with property insurance department. And we will look into it. I'll talk with you later, all right?\n#Person2#: It's OK. Bye bye!"}
{"fname": "hiddentest_67", "dialogue": "#Person1#: I need help planning my vacation.\n#Person2#: Sure, where would you like to go?\n#Person1#: I haven't decided where to go yet.\n#Person2#: Do you enjoy warm or cold climates?\n#Person1#: I am thinking that I might enjoy a tropical climate.\n#Person2#: I have some brochures here that you might like to look at.\n#Person1#: These look great!\n#Person2#: Do you know how much you want to spend on this vacation?\n#Person1#: I have about a thousand dollars to spend on this trip.\n#Person2#: Well, take these brochures, and get back to me when you want to make your reservations."}
{"fname": "hiddentest_68", "dialogue": "#Person1#: Hello, Nicole here.\n#Person2#: Nicole, this is Richard. I think you know why I'm calling.\n#Person1#: Oh, it's about the rent.\n#Person2#: Yes, this is the second month in a row.\n#Person1#: I thought there was a grace period.\n#Person2#: There is no grace period in the rental agreement.\n#Person1#: Oh, I guess I forgot.\n#Person2#: Well, when can I expect the rent?\n#Person1#: You'll get it by Monday.\n#Person2#: Don't forget the $50 late fee.\n#Person1#: Is that in the rental agreement?\n#Person2#: The late fee is circled in red ink!\n#Person1#: Oh, Well, I can't find my copy of the agreement.\n#Person2#: If you're late next month, I might give you an eviction notice."}
{"fname": "hiddentest_69", "dialogue": "#Person1#: I have to apologize.\n#Person2#: What happened?\n#Person1#: The medical instruments you've ordered are very popular in the market these days. I'm afraid we can't give you 50 pieces at one times.\n#Person2#: Then how many are available now?\n#Person1#: Maybe 20 pieces?\n#Person2#: Okay. But what about the 10% discount that we have agreed?\n#Person1#: We can still give you 10% off as promised.\n#Person2#: That's OK.\n#Person1#: Then you can open the relevant letter of credit now. We'll make preparation for delivery.\n#Person2#: We'll open it right now and send it through our bank.\n#Person1#: We'll dispatch the goods as soon as we receive it.\n#Person2#: Great!"}
{"fname": "hiddentest_70", "dialogue": "#Person1#: Let's discuss the delivery date first. You offered to deliver within six months after the contract signing.\n#Person2#: Yes. The interval is too long, I'm afraid. Could you deliver the goods sooner?\n#Person1#: I must say we can do very little in this matter. But we'd like to hear more from you on this. Then we shall see what can be done.\n#Person2#: Our idea is that you deliver within three months after the contract signing.\n#Person1#: Impossible! As you know, most parts of our product are produced here in our factory, but we also have some OEM parts. We have to order from them first.\n#Person2#: I see. Please let us know as soon as you get them.\n#Person1#: I'll certainly do that."}
{"fname": "hiddentest_71", "dialogue": "#Person1#: Oh, hello. Mr. Anderson.\n#Person2#: Hello, Susan.\n#Person1#: Nice of you to come to the party. This is Mrs. Anderson, I suppose?\n#Person2#: Yes. That's Helen.\n#Person3#: Hello! Nice to meet you!\n#Person1#: Well, Mrs. Anderson, welcome! My name's Susan Stewart, and as you know I work with your husband in the company. Do come in. Please.\n#Person3#: Thank you Susan.\n#Person2#: In fact, Susan is one of our brightest young women.\n#Person3#: Really? Yes, think you've mentioned her to me before, actually.\n#Person1#: What would you like to drink, Mrs. Anderson?\n#Person3#: Er, gin tonic. With ice and lemon?\n#Person1#: Gin and tonic. With ice and lemon.\n#Person3#: Yes, please.\n#Person1#: Oh, can I just introduce you to this is George Wilcox. Mr. and Mrs. Anderson.\n#Person3#: Oh!\n#Person4#: I think we know each other.\n#Person3#: Yes, I recognize your face.\n#Person4#: Yes, yes. Evening classes.\n#Person3#: That's right, yes. You come to French classes in evening.\n#Person4#: That't right.\n#Person3#: What a coincidence!\n#Person4#: Yes, it's a small world, isn't it?\n#Person3#: Well, George. I wonder if you've met my husband. I don't suppose you have met my husband.\n#Person4#: No, I haven't. How do you do, Mr. Anderson?\n#Person2#: Hello, George. Very nice to meet you."}
{"fname": "hiddentest_72", "dialogue": "#Person1#: Secretary Zhang, do you like traveling?\n#Person2#: Yes, very much. You know, I am awfully busy as a secretary, I want badly to relax myself. Traveling is really the best way to relax.\n#Person1#: Next week is the holiday. How about going sightseeing?\n#Person2#: Sounds great. Have you got any idea on the tour route, Li Dan?\n#Person1#: Not yet. Let's work it out together after work?\n#Person2#: Good idea. Shall we go to have a cup of coffee after work?\n#Person1#: How about the coffee shop next to our bureau?\n#Person2#: OK."}
{"fname": "hiddentest_73", "dialogue": "#Person1#: What coverage will you take out for the goods I've ordered?\n#Person2#: Did we conclude the business on CIF basis?\n#Person1#: Yes, CIF.\n#Person2#: Then we'll only insure W. P. A.\n#Person1#: Could you cover the Risk of Breakage for us?\n#Person2#: Risk of Breakage is classified under extraneous risk. As long as you put forward this request, we can cover the Risk of Breakage for you.\n#Person1#: Who will pay the premium for it?\n#Person2#: The additional premium is for buyer's account. That's for your account.\n#Person1#: That's understood.\n#Person2#: So, for this consignment, we shall cover W. P. A. and Risk of Breakage for 110% of the invoiced value."}
{"fname": "hiddentest_74", "dialogue": "#Person1#: Can we make payment by D/A?\n#Person2#: I'm sorry. We generally only accept payment by D/P or irrevocable letter of credit payable against shipping documents.\n#Person1#: If that is the case, we'll have to follow your convention.\n#Person2#: Thank you. And could you send us the L/C 30 days in advance? On receipt of your L/C we'll make the necessary arrangement for the shipment.\n#Person1#: OK. We'll instruct our bank to open an irrevocable documentary letter of credit in your favor.\n#Person2#: That's all right. Thank you."}
{"fname": "hiddentest_75", "dialogue": "#Person1#: Do you have an appointment?\n#Person2#: Yes, I have an appointment.\n#Person1#: The DMV windows are set up for different tasks. What are you here to do?\n#Person2#: I need to transfer ownership of a used car.\n#Person1#: I can see that you have all of your forms filled out. Drop the forms in that box, and I will call you when your name comes up.\n#Person2#: Thanks for helping me.\n#Person1#: You are welcome. May I see your current Driver's License?\n#Person2#: Here is my license, it is not a very good picture of me!\n#Person1#: That's a pretty good picture. Just pay the fee over at the last window and you're done!"}
{"fname": "hiddentest_76", "dialogue": "#Person1#: That rain is really coming down out there!\n#Person2#: Yes, it's kind of crazy weather outside.\n#Person1#: I get kind of nervous flying in this kind of weather.\n#Person2#: I don't think anyone feels all that comfortable flying in a storm.\n#Person1#: Do you think it will be this bad the whole trip?\n#Person2#: On the weather channel, this storm looked to be a big one. It will probably be with us for a while.\n#Person1#: I worry about too much ice on the wings.\n#Person2#: I have to believe that our pilot knows what he is doing and we'll be okay.\n#Person1#: When do you think the pilot will turn off the Fasten Your Seatbelt sign?\n#Person2#: He'll turn it off as soon as he knows that we are through the turbulence.\n#Person1#: Do you think that we are going to crash?\n#Person2#: Maybe. You just never know."}
{"fname": "hiddentest_77", "dialogue": "#Person1#: I really love the look of this car.\n#Person2#: Would you like to test drive this car?\n#Person1#: Yes, I would love to take it for a drive.\n#Person2#: I'll go get the keys, and you can get out your Driver's License and Proof of Insurance.\n#Person1#: Here's my Driver's License and Proof of Insurance.\n#Person2#: Well, just sign this card, and we'll be on our way. Don't forget to buckle your seat belt!\n#Person1#: Can I take it on the freeway to check for acceleration?\n#Person2#: That would be fine; just don't exceed the speed limit!\n#Person1#: This car handles great, and I love it!\n#Person2#: I am glad that you like this car."}
{"fname": "hiddentest_78", "dialogue": "#Person1#: I was wondering if you could help me book a few tours.\n#Person2#: You have come to the right place. How many days will you be visiting here?\n#Person1#: I will be here for a week.\n#Person2#: Have you ever visited our city before?\n#Person1#: This is my first time visiting this city.\n#Person2#: What are you interested in? Do you enjoy museums and buildings, or would you rather hit some outdoor hotspots and venues?\n#Person1#: I really enjoy visiting museums and art galleries.\n#Person2#: We have tours for all interests.\n#Person1#: Do you have a city tour?\n#Person2#: Yes, in fact, I usually suggest that to visitors."}
{"fname": "hiddentest_79", "dialogue": "#Person1#: Information Service Department. What can I do for you?\n#Person2#: This is Rainbow Import & Export Company, Beijing. We'd like to do business with Morning Light Medical Instruments Company. Before that, we want to know about their business status.\n#Person1#: Wait a minute, please. Ah, yes, ML has been our client for more that six years. It's a private company and enjoys good reputation in this area. As far as we know, it's always punctual to meet it commitments. It seems to be safe to do business with them.\n#Person2#: Good. Now we can do business with them with assurance. Thank you.\n#Person1#: You are welcome. Goodbye.\n#Person2#: Byebye."}
{"fname": "hiddentest_80", "dialogue": "#Person1#: That was a good lunch. It really hit the spot. Did you enjoy yours?\n#Person2#: Very good, thank you. Shall we get to the matter at hand?\n#Person1#: Yes, of course. I think I have an alternative that may solve everyone's problem.\n#Person2#: What's that?\n#Person1#: My client believes the present installation is fine as it is but she wants to avoid expensive litigation, so in order to appease everyone, she'll move the unit to the roof at her own cost. To prevent the conduit from being visible from the street, she is willing to pay to have it penetrate the roof.\n#Person2#: You know the board can't allow that. The building's documents don't give them the authority.\n#Person1#: I've received the documents. I think they do.\n#Person2#: I don't know how you can say that. That's a major change to the building's common area, the roof. Not only is it against the documents, it's contrary to state law.\n#Person1#: Well, I don't see how you can call that a major change to the common elements. We believe it's a minor change, and that it really affects no one but my client. Therefore, it is within the board's authority to grant my client's request.\n#Person2#: Well, you may be right except for one thing: penetrating the roof will compromise its integrity, and that is a major issue. That definitely moves it beyond the scope of board's authority."}
{"fname": "hiddentest_81", "dialogue": "#Person1#: Hi, John.\n#Person2#: Hello, Sue.\n#Person1#: Hey, it's really nice of you to come. I wasn't sure that you'd be able to.\n#Person2#: No, I wasn't certain I could make it either, but still I managed to get here.\n#Person1#: Hey, great! Come in.\n#Person2#: Oh, thanks very much. I can't stay long, I'm afraid. But I hope that's all right.\n#Person1#: Yeah, any problem?\n#Person2#: Well, no. It's just that I've got to meet someone later on.\n#Person1#: Oh, I see. OK, fine. Well, anyway, come in and have a drink.\n#Person2#: Lovely."}
{"fname": "hiddentest_82", "dialogue": "#Person1#: Excuse me. Do you have any vacancies tonight?\n#Person2#: I'm sorry. We're completely booked. Oh, wait. I see someone canceled earlier today. We have one single room left.\n#Person1#: Great. I need to get some sleep.\n#Person2#: It's 700 dollars plus tax. Is that all right?\n#Person1#: Yes, that's fine.\n#Person2#: Just write down your name and address on this form. Will you be paying by credit card?\n#Person1#: Yes.\n#Person2#: May I see your card for a moment, so I can write down the number?\n#Person1#: Yes. Here you are. Oh, by the way, will you give me a wakeup call at 7:30 tomorrow morning?\n#Person2#: Certainly. Let me write that down hmm, seven thirty, okay! Here's your room key. You're in 714."}
{"fname": "hiddentest_83", "dialogue": "#Person1#: Good morning!\n#Person2#: Good morning. I have an appointment with Mr. Chen Gui, the Account Manager, at 10:30.\n#Person1#: May I have your name, please?\n#Person2#: Mr. Simmonds from Mingda Trading Company.\n#Person1#: OK. I'll call the manager assistant right now.\n#Person2#: Mr. Chen Gui's office.\n#Person1#: This is reception. Mr. Simmonds from Mingda Trading Company is here for his 10:30 appointment.\n#Person2#: Oh, yes, that's right. I'll come and fetch him now.\n#Person1#: Thanks. Mr. Chen Gui's secretary is coming down now. There are some newspapers on the shelf if you'd like to read them.\n#Person2#: Thank you.\n#Person1#: Thanks. Bye.\n#Person2#: Bye."}
{"fname": "hiddentest_84", "dialogue": "#Person1#: We've considered your price and thought it acceptable.\n#Person2#: That's good. Then how many do you want?\n#Person1#: Can we just place a small order first? If they do sell well, we'll come back for more orders.\n#Person2#: That's all right. But I'd like to tell you that this kind of product represents the development trend in the next decade. Even in the United States, there are only a couple of manufacturers who can make it. And don't forget the 10% off if you buy 50 pieces.\n#Person1#: In that case, we'll order 50 of it.\n#Person2#: That's good. Then shall we sign the agreement now?\n#Person1#: OK."}
{"fname": "hiddentest_85", "dialogue": "#Person1#: What can I do for you?\n#Person2#: I came to you for advice on how to promote trade with China and other Asian countries?\n#Person1#: You are most welcome.\n#Person2#: The Chinese government seems to offer much encouragement to developing various flexible forms of trade. An idea came upon me while visiting the World Fair that I should adopt one of those forms to get inside the mainland territory. What would you suggest that I should do for our saloon car exports to Asia?\n#Person1#: Why don't you take advantage of the cheaper labour and the preferential polices in the Chinese coastal areas?\n#Person2#: In what way, please?\n#Person1#: You can produce the saloon car in China and sell them there and to other Asian countries. This can be done either on the basis of export processing or compensation trade.\n#Person2#: Hm I think the compensation trade arrangements suit me fine. Thank you very much for information."}
{"fname": "hiddentest_86", "dialogue": "#Person1#: I just arrived and need help getting transportation to my hotel.\n#Person2#: There are shuttles, taxis, and buses that go all over the city.\n#Person1#: Which one is the best form of transportation?\n#Person2#: It depends on where you want to go. If you are going to a well-known hotel, they have their own shuttles that drop you right off at the door.\n#Person1#: Where can I catch a cab?\n#Person2#: All ground transportation leaves from the island as you walk out the arrivals gate.\n#Person1#: Where can I rent a car?\n#Person2#: The car rental agencies are against the wall as you exit.\n#Person1#: Are there any subways in this town?\n#Person2#: We have a subway system, but you need to take a shuttle to get to the station."}
{"fname": "hiddentest_87", "dialogue": "#Person1#: Hey, I got this parking ticket. Can you help me figure a way out of it?\n#Person2#: First of all, did you park somewhere too long or in the wrong spot?\n#Person1#: I was there too long.\n#Person2#: Was the area clearly labeled with the time limit and all?\n#Person1#: Yeah, I saw it.\n#Person2#: You will need to convince the judge that you couldn't see the signs.\n#Person1#: Yeah, I understand.\n#Person2#: Whatever you do, you need to be respectful and polite to the judge.\n#Person1#: Yeah, you're right.\n#Person2#: Just try to talk to him about how sorry you are about the mistake you made, and promise that it won't happen again.\n#Person1#: OK, I will."}
{"fname": "hiddentest_88", "dialogue": "#Person1#: I have booked airline tickets online many times. It has worked out great for me!\n#Person2#: How do you book airline tickets online?\n#Person1#: The best way is to go to a website like Travelocity or Expedia. They can help you find the best price.\n#Person2#: What information do I need to provide to book a flight?\n#Person1#: You need to know where you are going and when you want to travel.\n#Person2#: How do I get the cheapest rate?\n#Person1#: Usually you get the best price by having some flexibility in your travel time and dates.\n#Person2#: Can I fly on different airlines?\n#Person1#: You can choose the airline you prefer to fly with or let the website find you the best deal."}
{"fname": "hiddentest_89", "dialogue": "#Person1#: Thank you for helping me move.\n#Person2#: Don't mention it. Where do you want all your furniture?\n#Person1#: Okay, I want you to put the sofa in the living room.\n#Person2#: Would you like me to put it anywhere special?\n#Person1#: No, up against the wall is just fine.\n#Person2#: Where would you like this table?\n#Person1#: That table should go in the dining room.\n#Person2#: Would you like me to put it anywhere in particular?\n#Person1#: You can place it right in the center of the room.\n#Person2#: How are things looking so far?\n#Person1#: I think the furniture looks nice in here.\n#Person2#: You're absolutely right."}
{"fname": "hiddentest_90", "dialogue": "#Person1#: Now the price issue is settled. May I ask you a question?\n#Person2#: Go ahead, please.\n#Person1#: Could you agree to payment by D/A? This is a sample order.\n#Person2#: Occasionally we do. But we will consider that when we make you the firm offer.\n#Person1#: Thanks.\n#Person2#: I hope after the first supply your customers will place regular orders.\n#Person1#: For regular orders, couldn't you agree to payment by L/C at 90 day's sight?\n#Person2#: I am afraid not. Our usual practice is L/C at sight.\n#Person1#: I see.\n#Person2#: The car is coming to pick us up. We will discuss that later.\n#Person1#: Good idea.\n#Person2#: Let's go."}
{"fname": "hiddentest_91", "dialogue": "#Person1#: It's a quite nice restaurant, isn't it, Director Hu?\n#Person2#: Sure. I often have my lunch here. The food is tasty and they offer a big variety.\n#Person1#: Yes, the beefsteak is inviting. I'll have beefsteak.\n#Person2#: I'll have some fish and vegetables.\n#Person1#: Where shall we seat?\n#Person2#: How about by the window?\n#Person1#: OK. You go first.\n#Person2#: Xiao Liu. Where do you have lunch during your work time?\n#Person1#: In the dining room of Education Bureau. What about you?\n#Person2#: I often have lunch at home. My house is near my working place."}
{"fname": "hiddentest_92", "dialogue": "#Person1#: Hangzhou is beautiful and the weather is marvelous.\n#Person2#: I know why it is called paradise on earth.\n#Person1#: Please hurry up. I really can't wait to see the West Lake.\n#Person2#: Don't worry. Look, here we are.\n#Person1#: What a beautiful lake!\n#Person2#: The beautiful scenery was beyond my imagination.\n#Person1#: It is the biggest lake I've ever seen before.\n#Person2#: Look, there is an island in the middle of the lake.\n#Person1#: Look there! What's that building on the island?\n#Person2#: I don't know. shall we rent a boat to go there?\n#Person1#: Good idea!"}
{"fname": "hiddentest_93", "dialogue": "#Person1#: I need your help with something.\n#Person2#: What's wrong?\n#Person1#: I somehow locked myself out of my apartment.\n#Person2#: How did you lock yourself out?\n#Person1#: I'm really not sure.\n#Person2#: Where's your key?\n#Person1#: I locked it inside the house.\n#Person2#: I do have a spare key to your door.\n#Person1#: May I use it, please?\n#Person2#: Okay, but once you get in, bring my key right back.\n#Person1#: I will, and thank you so much.\n#Person2#: Make sure to keep your key with you next time."}
{"fname": "hiddentest_94", "dialogue": "#Person1#: Hi. I'm Jack. You called about the room for rent. Are you still interested?\n#Person2#: Yes, I am.\n#Person1#: I was wondering if I could ask you a couple of questions.\n#Person2#: Shoot.\n#Person1#: I just want to be sure that we get along.\n#Person2#: I agree with you 100 percent--we must get along.\n#Person1#: Are you a party animal?\n#Person2#: Oh, no. I'm a very quiet person.\n#Person1#: Great! Next: Are you neat or are you a slob?\n#Person2#: I'm a pretty neat person.\n#Person1#: Are you a night owl or a day person?\n#Person2#: Early to bed, early to rise.\n#Person1#: Finally, do you smoke?\n#Person2#: Actually, I quit smoking four years ago.\n#Person1#: Excellent answers. Do you have any questions for me?\n#Person2#: Just one: Is there a parking lot?\n#Person1#: Unfortunately, you have to park in the street.\n#Person2#: Well, I'm desperate. I'll take it anyway.\n#Person1#: Great! Let me know when you're ready to move in.\n#Person2#: I think it will be tomorrow if that's okay.\n#Person1#: No problem. I'll be here all day tomorrow."}
{"fname": "hiddentest_95", "dialogue": "#Person1#: Since it is the first time we are doing business with you, I am afraid I am not quite clear on the arbitration clause.\n#Person2#: Anything particular you want to know?\n#Person1#: Please explain it in general.\n#Person2#: OK. Generally speaking, we hold all disputes can be settled amicably by negotiation.\n#Person1#: If negotiation fails, then what?\n#Person2#: The case may be submitted for arbitration in a third country, countries like Switzerland and Sweden.\n#Person1#: I see.\n#Person2#: The decision of the arbitration shall be accepted as final and binding upon both parties.\n#Person1#: What about the cost?\n#Person2#: The arbitration cost shall be borne by the losing party.\n#Person1#: Thank you for your time. Now I understand.\n#Person2#: It's my pleasure."}
{"fname": "hiddentest_96", "dialogue": "#Person1#: Hi. How can I help you today?\n#Person2#: Well, my window facing the empty lot is broken.\n#Person1#: Oh, that's not good. What happened?\n#Person2#: I don't know. I wasn't home when it happened.\n#Person1#: Do you have any clue who might have done this?\n#Person2#: I have a feeling that it might have been the neighborhood kids.\n#Person1#: Why, what leads you to that suspicion?\n#Person2#: Well, next to the broken glass was a baseball.\n#Person1#: Well, a baseball is certainly solid evidence.\n#Person2#: I saw them playing just before I left my apartment.\n#Person1#: Well, did you recognize any of them?\n#Person2#: No, I just took a quick look.\n#Person1#: Well, it'll take a couple of days to repair it.\n#Person2#: A friend of mine is in the business. How about if I call him?\n#Person1#: That's okay by me. First, let me come see the damage.\n#Person2#: Come on over. So does my friend charge you or me?\n#Person1#: Since you didn't break it, you don't have to pay for it.\n#Person2#: That's a relief. I thought I was going to get stuck with the bill.\n#Person1#: If I knew which kid did it, I would bill his parents."}
{"fname": "hiddentest_97", "dialogue": "#Person1#: Mr. Zhao, how long have you worked for MOFCOM?\n#Person2#: Four years, I joined MOFCOM in 1999.\n#Person1#: Which department are you affiliated with?\n#Person2#: I am now with the Protocol Department, I am an interpreter.\n#Person1#: No wonder your English is so good. Where did you learn your English?\n#Person2#: Thank you for saying that. Well, mostly in China. Three years at high school and four years of intensive training at university, plus a short stay in the U. S. two years after I joined MOFCOM.\n#Person1#: Terrific.\n#Person2#: Well, here we are at the hotel. Can you check in all by yourself?\n#Person1#: Sure, yes. Thank you for all you have done for me, Mr. Zhao. I will see you later.\n#Person2#: Sure. Have a good day, Mr. Smith."}
{"fname": "hiddentest_98", "dialogue": "#Person1#: Yes, I can hear them. What is that pounding sound?\n#Person2#: I think that they are hammering nails to hang pictures.\n#Person1#: How often do you hear them making noise?\n#Person2#: They play their music really loud, and I can hear it.\n#Person1#: Have you spoken to them about the noise problem?\n#Person2#: No, I haven't spoken with them about it.\n#Person1#: What else do you hear that bothers you?\n#Person2#: I hear a lot of plumbing sounds, like the toilet flushing and the dishwasher running.\n#Person1#: If this continues, I would speak to the manager."}
{"fname": "hiddentest_99", "dialogue": "#Person1#: I can help you. Do you have a down payment?\n#Person2#: Yes, I have saved up three thousand dollars for a down payment.\n#Person1#: Good, because you will not be able to get a loan without putting some money down on the car.\n#Person2#: I don't know where exactly to get a loan.\n#Person1#: Other than friends or family, you can go to a bank, credit union, or use the dealer financing if you bought the car off a car lot.\n#Person2#: What is the best choice for financing?\n#Person1#: It depends. The worst financing deal is usually at the dealer, but they will oftentimes give you a loan when a bank turns you down.\n#Person2#: What do I need to have with me when I apply for the loan?\n#Person1#: You will need a recent pay stub and a copy of the pink slip for the car. Before the loan is complete, you will need to show proof of insurance. Good luck!"}
